import ServiceCard from "./ServicesCard";

const services = [
  {
    img: "/card1.png",
    title: "Присвоєння  \nкадастрового номера",
    text: "Присвоєння кадастрового номера — обов'язкова складова процесу приватизації, оформлення прав ",
    slug: "kadastrovyy-nomer",
  },

  {
    img: "/card2.png",
    title: "Проєкт із землеустрою",
    text: "Проєкт землеустрою  — це землевпорядна документація, яка розробляється при першому оформленні права власності або користування(оренди) на землю....",
    slug: "proekt-zemleustroyu",
  },

  {
    img: "/card3.png",
    title: "Поділ та об’єднання \nземельних ділянок",
    text: "Формування земельних ділянок шляхом поділу та об'єднання раніше сформованих земельних ділянок, які перебувають у власності або користуванні....",
    slug: "podil-obiednannya",
  },
  {
    img: "/card4.png",
    title: "Встановення меж земельної ділянки",
    text: "Встановлення меж земельної ділянки в натурі (на місцевості) – це визначення за допомогою геодезичних пристроїв місця знаходження поворотних точок меж земельної ділянки...",
    slug: "vstanovlennya-mezh",
  },
  {
    img: "/card5.png",
    title: "Зміна цільового призначення земельних ділянок",
    text: "Встановлення меж земельної ділянки в натурі (на місцевості) – це зміна її призначення з одного виду користування на інший, зазвичай з метою розвитку іншого виду діяльності...",
    slug: "zmina-tsilovogo",
  },
  {
    img: "/card6.png",
    title: "Топографічна зйомка земельної ділянки",
    text: "Топографічна зйомка земельної ділянки - це комплекс геодезичних робіт, спрямованих на створення детального плану місцевості, що показує рельєф...",
    slug: "topografichna-zyomka",
  },
  {
    img: "/card7.png",
    title: "Експертна оцінка земельної ділянки",
    text: "Визначення ринкової вартості земельної ділянки для угод купівлі-продажу, спадкування, застави або судових спорів...",
    slug: "ekspertna-otsinka",
  },
  {
    img: "/card8.png",
    title: "Замовлення XML обмінного файлу",
    text: "Цифровий документ, необхідний для реєстрації ділянки в Державному земельному кадастрі (ДЗК), внесення змін до неї або укладання угод...",
    slug: "xml-file",
  },
  {
    img: "/card9.png",
    title: "Оформлення технічного паспорта",
    text: "Процедура передбачає обміри об’єкта та внесення даних до електронної системи...",
    slug: "tehnichnyy-pasport",
  },
];

export default function Services() {
  return (
    <section className="bg-[#E2DFDF] py-[80px]" id="services">
      <h2 className="text-[28px] md:text-[34px] lg:text-4xl text-[#000000] text-center font-medium px-6">
        Послуги які ми надаємо
      </h2>
      <h3 className="text-[16px] md:text-lg text-[#626262] text-center font-medium pt-[15px] px-6">
        Замовляючи у нас послугу ви отримуєте гарантію на виконання і на якість
        нашої роботи!
      </h3>
      <div
        className="    mt-10
    grid
    grid-cols-1
    lg:grid-cols-2
    gap-8
    px-6
    md:px-10
    pt-[50px]"
      >
        {services.map((service, index) => (
          <ServiceCard
            key={index}
            img={service.img}
            title={service.title}
            text={service.text}
            slug={service.slug}
          />
        ))}
      </div>
    </section>
  );
}
